app/views/articles/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1
---
<h2>コメント</h2>
<% @article.comments.each do |comment| %>